server/template/0/U
/*--------------------------------*- C++ -*----------------------------------*\
=========                 |
\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
 \    /   O peration     | Website:  https://openfoam.org
  \\  /    A nd           | Version:  10
   \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// ************************************************************************* //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletVelocity;
        z0              uniform {{terrainZ0}};
        d               uniform 0;
        flowDir         ({{windDirX}} {{windDirY}} {{windDirZ}});
        zDir            (0 0 1);
        kappa           0.41;
        Cmu             0.09;
        Uref            {{Uref}};
        Zref            {{Zref}};
        zGround         uniform {{zGround}};
        value           uniform ({{UinletX}} {{UinletY}} {{UinletZ}});
    }
    outlet
    {
        type            zeroGradient;
    }
    sides
    {
        type            symmetry;
    }
    top
    {
        type            symmetry;
    }
    ground
    {
        type            noSlip;
    }

    structure
    {
        type            noSlip;
    }

    terrain
    {
        type            noSlip;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //

