server/template/0/k
/*--------------------------------*- C++ -*----------------------------------*\
=========                 |
\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
 \    /   O peration     | Website:  https://openfoam.org
  \\  /    A nd           | Version:  10
   \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// ************************************************************************* //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform {{kInlet}};

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletK;
        z0              uniform {{terrainZ0}};
        d               uniform 0;
        flowDir         ({{windDirX}} {{windDirY}} {{windDirZ}});
        zDir            (0 0 1);
        kappa           0.41;
        Cmu             0.09;
        Uref            {{Uref}};
        Zref            {{Zref}};
        zGround         uniform {{zGround}};
        value           uniform {{kInlet}};
    }
    outlet
    {
        type            zeroGradient;
    }
    sides
    {
        type            symmetry;
    }
    top
    {
        type            symmetry;
    }
    ground
    {
        type kqRWallFunction;
        value uniform {{kInlet}};
    }
    structure
    {
        type kqRWallFunction;
        value uniform {{kInlet}};
    }
    terrain
    {
        type kqRWallFunction;
        value uniform {{kInlet}};
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //

