server/template/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
=========                 |
\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
 \    /   O peration     | Website:  https://openfoam.org
  \\  /    A nd           | Version:  10
   \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// ************************************************************************* //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    sides
    {
        type            symmetry;
    }
    top
    {
        type            symmetry;
    }
    ground
    {
        type atmNutkWallFunction;
        Cmu 0.09;
        kappa 0.41;
        E 9.8;
        z0 uniform {{terrainZ0}};
        value uniform 0;
    }
    structure
    {
        type nutkWallFunction;
        Cmu 0.09;
        kappa 0.41;
        E 9.8;
        value uniform 0;
    }
    terrain
    {
        type atmNutkWallFunction;
        Cmu 0.09;
        kappa 0.41;
        E 9.8;
        z0 uniform {{terrainZ0}};
        value uniform 0;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //

